In [175]:
import pandas as pd
from datetime import datetime, date

## Importing the Dataset

In [176]:
df = pd.read_csv('C:/Users/91987/OneDrive/Desktop/Amisha/Projects/SQL/Bank Customer Segmentation Dataset/bank_transactions.csv')
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10-01-1994,F,JAMSHEDPUR,17819.05,02-08-2016,143207,25.0
1,T2,C2142763,04-04-1957,M,JHAJJAR,2270.69,02-08-2016,141858,27999.0
2,T3,C4417068,26-11-1996,F,MUMBAI,17874.44,02-08-2016,142712,459.0
3,T4,C5342380,14-09-1973,F,MUMBAI,866503.21,02-08-2016,142714,2060.0
4,T5,C9031234,24-03-1988,F,NAVI MUMBAI,6714.43,02-08-2016,181156,1762.5

In [177]:
df.shape

(1048567, 9)

In [178]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048567 entries, 0 to 1048566
Data columns (total 9 columns):
 #   Column                   Non-Null Count    Dtype
---  ------                   --------------    -----
 0   TransactionID            1048567 non-null  object
 1   CustomerID               1048567 non-null  object
 2   CustomerDOB              1045170 non-null  object
 3   CustGender               1047467 non-null  object
 4   CustLocation             1048416 non-null  object
 5   CustAccountBalance       1046198 non-null  float64
 6   TransactionDate          1048567 non-null  object
 7   TransactionTime          1048567 non-null  int64
 8   TransactionAmount (INR)  1048567 non-null  float64
dtypes: float64(2), int64(1), object(6)
memory usage: 72.0+ MB

In [179]:
df.dtypes

TransactionID               object
CustomerID                  object
CustomerDOB                 object
CustGender                  object
CustLocation                object
CustAccountBalance         float64
TransactionDate             object
TransactionTime              int64
TransactionAmount (INR)    float64
dtype: object

#### Replacing error values from CustomerDOB column

In [180]:
df.loc[df['CustomerDOB'] == '1/1/1800', 'CustomerDOB'] = 'nan'

##### Now Converting CustomerDOB and TransactionDate columns into date datatype

In [181]:
df['CustomerDOB'] = pd.to_datetime(df['CustomerDOB'], errors='coerce', format='%d-%m-%Y')

In [182]:
df['TransactionDate'] = pd.to_datetime(df['TransactionDate'], errors='coerce', format='%d-%m-%Y')

In [183]:
df.dtypes

TransactionID                      object
CustomerID                         object
CustomerDOB                datetime64[ns]
CustGender                         object
CustLocation                       object
CustAccountBalance                float64
TransactionDate            datetime64[ns]
TransactionTime                     int64
TransactionAmount (INR)           float64
dtype: object

##### Converting CustLocation column value from uppercase to proper case

In [184]:
df['CustLocation'] = df['CustLocation'].str.title()

##### Checking for null values

In [185]:
df.isnull().sum()

TransactionID                  0
CustomerID                     0
CustomerDOB                60736
CustGender                  1100
CustLocation                 151
CustAccountBalance          2369
TransactionDate                0
TransactionTime                0
TransactionAmount (INR)        0
dtype: int64

##### Filling null values of CustGender and CustLocation columns with Not Specified

In [186]:
df.loc[df['CustGender'].isnull(), 'CustGender'] = 'Not Specified'

In [187]:
df.isnull().sum()

TransactionID                  0
CustomerID                     0
CustomerDOB                60736
CustGender                     0
CustLocation                 151
CustAccountBalance          2369
TransactionDate                0
TransactionTime                0
TransactionAmount (INR)        0
dtype: int64

In [188]:
df.loc[df['CustLocation'].isnull(), 'CustLocation'] = 'Not Specified'

##### Droping CustomerDOB null values

In [189]:
df = df.dropna(subset = ['CustomerDOB'])

In [190]:
df.isnull().sum()

TransactionID                 0
CustomerID                    0
CustomerDOB                   0
CustGender                    0
CustLocation                  0
CustAccountBalance         2194
TransactionDate               0
TransactionTime               0
TransactionAmount (INR)       0
dtype: int64

##### Calculating Age of Customers

In [192]:
current_date = pd.to_datetime(datetime.now().date())

In [222]:
df['Age'] = (current_date.year - df['CustomerDOB'].dt.year) - \
            ((current_date.month < df['CustomerDOB'].dt.month) | 
             ((current_date.month == df['CustomerDOB'].dt.month) & 
              (current_date.day < df['CustomerDOB'].dt.day)))

##### Converting TransactionTime datatype from int to time

In [194]:
df['TransactionTime'] = df['TransactionTime'].astype('str')

In [195]:
#Pads the string with leading zeros to ensure it is 6 digits long.
df['TransactionTime'] = df['TransactionTime'].str.zfill(6)

In [196]:
df['TransactionTime'] = pd.to_datetime(df['TransactionTime'], format='%H%M%S').dt.time

In [197]:
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),Age
0,T1,C5841053,1994-01-10,F,Jamshedpur,17819.05,2016-08-02,14:32:07,25.0,30
1,T2,C2142763,1957-04-04,M,Jhajjar,2270.69,2016-08-02,14:18:58,27999.0,67
2,T3,C4417068,1996-11-26,F,Mumbai,17874.44,2016-08-02,14:27:12,459.0,27
3,T4,C5342380,1973-09-14,F,Mumbai,866503.21,2016-08-02,14:27:14,2060.0,50
4,T5,C9031234,1988-03-24,F,Navi Mumbai,6714.43,2016-08-02,18:11:56,1762.5,36

##### Checking for duplicates

In [201]:
df[df.duplicated()]

Empty DataFrame
Columns: [TransactionID, CustomerID, CustomerDOB, CustGender, CustLocation, CustAccountBalance, TransactionDate, TransactionTime, TransactionAmount (INR), Age]
Index: []

In [214]:
df.rename(columns={'TransactionAmount(INR)': 'TransactionAmount'}, inplace = True)

In [215]:
df.columns

Index(['TransactionID', 'CustomerID', 'CustomerDOB', 'CustGender',
       'CustLocation', 'CustAccountBalance', 'TransactionDate',
       'TransactionTime', 'TransactionAmount', 'Age'],
      dtype='object')

### Importing the data into database

In [225]:
import sqlalchemy as sal
engine = sal.create_engine('mssql://LAPTOP-ULT14LHF\SQLEXPRESS/bank_transactions?driver=ODBC+DRIVER+17+FOR+SQL+SERVER')
conn = engine.connect()

In [226]:
df.to_sql('cust_transactions', con = conn, index = False, if_exists = 'replace')

-1